# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)
Hotel.create([
	{
		name: "Гостевой дом Версаль2",
		description: "Гостевой Дом Версаль 2 находится в городе Адлер по адресу улица Просвещения, 97. Это район Курортного городка – излюбленное место отдыха гостей со всей России и зарубежья.

В гостевом доме “Версаль 2” гости могут остановиться в следующих номерах:

    двухкомнатный четырехместный номер
    трехместный люкс
    трехместный стандарт
    двухместный делюкс с одной двуспальной кроватью
    двухместный делюкс с двумя односпальными кроватями

На территории отеля предоставляется доступ в интернет. При желании можно заказать трансфер от/до аэропорта, железнодорожного вокзала. Если у вас возникнет вопрос вы всегда сможете обратиться к сотрудникам круглосуточной стойки регистрации.

Гостевой дом «Версаль 2» с собственным баром расположен в Адлере, в 500 метрах от океанариума Sochi Discovery World. С террасы гостевого дома открывается вид на город.

Все номера гостевого дома оснащены кондиционером, телевизором с плоским экраном, холодильником и теплыми полами. В номерах есть собственная ванная комната. На всей территории гостевого дома «Версаль 2» действует бесплатный Wi-Fi.

Стойка регистрации работает круглосуточно.

Для гостей организован прокат велосипедов. Расстояние от гостевого дома «Версаль 2» до дельфинария «Акватория» составляет 300 метров, а до аквапарка «Амфибиус» — 1,4 км. Ближайший к гостевому дому «Версаль 2» международный аэропорт Адлер-Сочи находится в 5 км.

Заезд     C 14:00
 Отъезд  До 11:00
Бронирование номеров в нашем отеле возможно только при внесении предоплаты за проживание в размере стоимости первой ночи проживания.ВНИМАНИЕ! Предоплата возвращается в случае если Вы сообщили об отмене поездки не менее чем за 14 (четырнадцать) дней до забронированной даты!!! В противном случае предоплата не возвращается!
Без внесения предоплаты администрация отеля не гарантирует наличие свободных мест

В гостевом доме “Версаль 2” разрешается проживание детей любого возраста.

Дети до 3 лет проживают бесплатно на имеющихся кроватях, без предоставления дополнительного места. Есть возможность предоставить детскую кроватку (стоимость 100 рублей в сутки)

Стоимость дополнительного места для взрослых и детей старше 3 лет – 300 рублей в сутки.
Не допускается бесплатное размещение детей старше 3 лет на имеющихся кроватях, без оплаты за дополнительное место при заселении в номер большего числа людей, чем предусмотрено условиями данного номера.
Максимальное количество дополнительных кроватей в номере – 1.Дополнительные кровати и детские кроватки предоставляются по запросу. Требуется подтверждение со стороны отеля о предоставлении данной услуги.Дополнительные услуги не включаются автоматически в общую стоимость и оплачиваются отдельно во время вашего проживания.

Домашние животные:  Размещение домашних животных не допускается.
"	},
 { name: "ЭКО-Отель \"Кипарисовая Роща\"",
 description: "В лесном массиве на берегу моря, в окружении кипарисов, деревьев о которых существует самое большое количество легенд, у народов всего мира, начинает свою деятельность ЭКО-Отель “Кипарисовая Усадьба”. Отличительными особенностями которого  являются:

1. Лучшее соотношение цены/качества

2. Отдельные коттеджи с изолированными номерами

3. На территории отеля крытый бассейн, детская площадка, кафе, кинотеатр под открытым небом, 3D-планетарий, аниматоры, СПА и все – это только для отдыхающих

4. Неповторимая вечнозеленая атмосфера Кипарисовой рощи

5. Фруктовая ярмарка прямо у входа в отель

6. Гипоаллергенные номера

7. Неповторимый дизайнерский экостиль

В отеле есть номера следующих категорий:


    – Трехместный делюкс

    – Двухместный делюкс

    – Двухместный стандарт плюс (две односпальные кровати)

    – Двухместный стандарт (две односпальные кровати)

Эко – отель «Кипарисовая Усадьба» – идеальное место для тех, кто ищет покоя и комфорта даже в курортной суете. Отель Кипарисовая Усадьба пропитан морским воздухом, красотой и единением с природой. Море, горы и уникальный кипарисовый парк создают неповторимое сочетание.

Кипарис имеет твердую насыщенную высоким содержанием смолы древесину. Раньше Кипарис был редкой и дорогой породой дерева. Позволить себе иметь из него изделия могли только очень богатые люди. Из хвои и веток Кипариса изготавливают эфирное масло, которое с успехом используют в ароматерапии и медицины. Благодаря своим антисептическим, тонизирующими свойствами масло эффективно против стафилококков и туберкулезной палочки. Больным подагрой и артритами рекомендуют принимать ванны с Кипарисовым маслом. Кипарис обладает мощной мужской энергетикой. Имея фаллическую форму, он считается поистине мужским деревом. Оказывающим воздействие на мужскую потенцию. Если находиться в непосредственной близости возле растения, энергия Кипариса одарит мужчину ореолом неотразимости и сексуальной энергии.

Отель «Кипарисовая Усадьба» отлично подходит для спокойного отдыха. Вечнозеленая и прохладная территория. Состоит из четырех коттеджей, в которых расположились гипоаллергенные номера. Уютного кафе, беседками возле каждого коттеджа. Крытым бассейном, СПА комплексом, фруктовой ярмаркой, магазином, бесплатной парковкой, стрелковым тиром и многим другим.

«Кипарисовая Усадьба» расположена на границе п. Нижняя Хобза и Лоо, Лазаревского района города Сочи, в 5-7 минутах ходьбы до галечного пляжа. На пляже вы можете покататься на гидроциклах, «банане», позагорать на шезлонгах и многое другое.

Номера в отеле имеют свой необычный стиль и шарм. Ведь каждый из номеров имеет неповторимую стилистику. Дизайн всей инфраструктуры выдержан в «экостиле» Все номера с удобствами, оснащены телевизором, мини-баром, телефоном, во всей гостинице бесплатный Wi-Fi. На территории отеля свой микроклимат, который создает даже в знойную жару – прохладу, поэтому кондиционеры не требуются. Мы стараемся сделать все для вашего комфортного отдыха."
}
])
Room.create([
    { name: "Трехместный стандарт",description: "Трехместный номер с двумя кроватями",bed: 3,lux: false,hotel_id: 1},
    { name: "Двухместный делюкс",description: "Двухместный делюкс с одной двуспальной кроватью",bed: 2,lux: true,hotel_id: 1},
    { name: "Двухместный делюкс",description: "Двухместный делюкс с двумя односпальными кроватями",bed: 4,lux: true,hotel_id: 1},
    { name: "Трехместный люкс",description: "Трехместный номер люкс",bed: 3,lux: true,hotel_id: 1},
    { name: "Четырехместный номер",description: "Четырехместный двухкомнатный номер",bed: 4,lux: true,hotel_id: 1}
    ])
