# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)
Hotel.create([
	{
		name: "Гостевой дом Версаль2",
		description: '<p>Гостевой Дом Версаль 2 находится в городе Адлер по адресу улица Просвещения, 97. Это район Курортного городка &ndash; излюбленное место отдыха гостей со всей России и зарубежья.</p>

<p>Бронирование номеров в нашем отеле возможно только при внесении предоплаты за проживание в размере стоимости первой ночи проживания.ВНИМАНИЕ! Предоплата возвращается в случае если Вы сообщили об отмене поездки не менее чем за 14 (четырнадцать) дней до забронированной даты!!! В противном случае предоплата не возвращается! Без внесения предоплаты администрация отеля не гарантирует наличие свободных мест <strong>Заезд</strong> C 14:00 <strong>&nbsp;Отъезд </strong>До 11:00</p>
<p>Бронирование номеров в нашем отеле возможно только при внесении предоплаты за проживание в размере стоимости первой ночи проживания.ВНИМАНИЕ! Предоплата возвращается в случае если Вы сообщили об отмене поездки не менее чем за 14 (четырнадцать) дней до забронированной даты!!! В противном случае предоплата не возвращается!<br /> Без внесения предоплаты администрация отеля не гарантирует наличие свободных мест</p>
<p>В гостевом доме &ldquo;Версаль 2&rdquo; разрешается проживание детей любого возраста. </p>
<p>Дети до 3 лет проживают бесплатно на имеющихся кроватях, без предоставления дополнительного места. Есть возможность предоставить детскую кроватку (стоимость 100 рублей в сутки)<br /> </p>
<p>Стоимость дополнительного места для взрослых и детей старше 3 лет &ndash; 300 рублей в сутки.</p>
<p>Не допускается бесплатное размещение детей старше 3 лет на имеющихся кроватях, без оплаты за дополнительное место при заселении в номер большего числа людей, чем предусмотрено условиями данного номера.<br /> Максимальное количество дополнительных кроватей в номере &ndash; 1.Дополнительные кровати и детские кроватки предоставляются по запросу. Требуется подтверждение со стороны отеля о предоставлении данной услуги.Дополнительные услуги не включаются автоматически в общую стоимость и оплачиваются отдельно во время вашего проживания.</p>
<p><strong>Домашние животные:&nbsp;</strong> Размещение домашних животных не допускается.</p>
'},
 { name: "ЭКО-Отель \"Кипарисовая Роща\"",
 description: '<div>
<p>В лесном массиве на берегу моря, в окружении кипарисов, деревьев о которых существует самое большое количество легенд, у народов всего мира, начинает свою деятельность ЭКО-Отель &ldquo;Кипарисовая Усадьба&rdquo;. Отличительными особенностями которого являются:</p>
<p>1. Лучшее соотношение цены/качества</p>
<p>2. Отдельные коттеджи с изолированными номерами</p>
<p>3. На территории отеля крытый бассейн, детская площадка, кафе, кинотеатр под открытым небом, 3D-планетарий, аниматоры и все &ndash; это только для отдыхающих</p>
<p>4. Неповторимая вечнозеленая атмосфера Кипарисовой рощи</p>
<p>5. Фруктовая ярмарка прямо у входа в отель</p>
<p>6. Гипоаллергенные номера</p>
<p>7. Неповторимый дизайнерский экостиль</p>
<p>В отеле есть номера следующих категорий:</p>
<p>Эко &ndash; отель &laquo;Кипарисовая Усадьба&raquo; &ndash; идеальное место для тех, кто ищет покоя и комфорта даже в курортной суете. Отель Кипарисовая Усадьба пропитан морским воздухом, красотой и единением с природой. Море, горы и уникальный кипарисовый парк создают неповторимое сочетание.</p>
<p><img src="http://www.hotelludi.ru/wp-content/uploads/2017/01/test_01_1_20150716_1148736245-300x197.jpg" alt="" /></p>
<p>Кипарис имеет твердую насыщенную высоким содержанием смолы древесину. Раньше Кипарис был редкой и дорогой породой дерева. Позволить себе иметь из него изделия могли только очень богатые люди. Из хвои и веток Кипариса изготавливают эфирное масло, которое с успехом используют в ароматерапии и медицины. Благодаря своим антисептическим, тонизирующими свойствами масло эффективно против стафилококков и туберкулезной палочки. Больным подагрой и артритами рекомендуют принимать ванны с Кипарисовым маслом. Кипарис обладает мощной мужской энергетикой. Имея фаллическую форму, он считается поистине мужским деревом. Оказывающим воздействие на мужскую потенцию. Если находиться в непосредственной близости возле растения, энергия Кипариса одарит мужчину ореолом неотразимости и сексуальной энергии.</p>
<p>Отель &laquo;Кипарисовая Усадьба&raquo; отлично подходит для спокойного отдыха. Вечнозеленая и прохладная территория. Состоит из четырех коттеджей, в которых расположились гипоаллергенные номера. Уютного кафе, беседками возле каждого коттеджа. Крытым бассейном, фруктовой ярмаркой, парковкой и многим другим.</p>
<p><img src="http://www.hotelludi.ru/wp-content/uploads/2017/01/test_01_1_20150716_1814431627-300x212.jpg" alt="" /></p>
<p>&laquo;Кипарисовая Усадьба&raquo; расположена на границе п. Нижняя Хобза и Лоо, Лазаревского района города Сочи, в 5-7 минутах ходьбы до галечного пляжа.</p>
<p><img src="http://www.hotelludi.ru/wp-content/uploads/2017/01/test_01_1_20150716_1859607527-300x198.jpg" alt="" /></p>
<p>Номера в отеле имеют свой необычный стиль и шарм. Ведь каждый из номеров имеет неповторимую стилистику. Дизайн всей инфраструктуры выдержан в &laquo;экостиле&raquo; Все номера с удобствами, оснащены телевизором, мини-баром, телефоном, во всей гостинице бесплатный Wi-Fi. На территории отеля свой микроклимат, который создает даже в знойную жару &ndash; прохладу, поэтому кондиционеры не требуются. Мы стараемся сделать все для вашего комфортного отдыха.</p>
</div>'}
])
Room.create([
    { name: "Трехместный стандарт",description: "Трехместный номер с двумя кроватями",bed: 3,lux: false,hotel_id: 1},
    { name: "Двухместный делюкс",description: "Двухместный делюкс с одной двуспальной кроватью",bed: 2,lux: true,hotel_id: 1},
    { name: "Двухместный делюкс",description: "Двухместный делюкс с двумя односпальными кроватями",bed: 4,lux: true,hotel_id: 1},
    { name: "Трехместный люкс",description: "Трехместный номер люкс",bed: 3,lux: true,hotel_id: 1},
    { name: "Четырехместный номер",description: "Четырехместный двухкомнатный номер",bed: 4,lux: true,hotel_id: 1}
    ])
Price.create([
    {price: 1300.0, description: "", room_id: 1},
    {price: 1000.0, description: "", room_id: 2},
    {price: 1000.0, description: "", room_id: 3},
    {price: 1500.0, description: "", room_id: 4},
    {price: 1500.0, description: "", room_id: 5}
    ])
Taryph.create([
    {udate: "2017-01-10",edate: "2017-04-26", index: 500.0, price_id: 1},
    {udate: "2017-04-26",edate: "2017-05-10", index: 900.0, price_id: 1},
    {udate: "2017-05-10",edate: "2017-06-01", index: 300.0, price_id: 1},
    {udate: "2017-06-01",edate: "2017-06-15", index: 1500.0, price_id: 1},
    {udate: "2017-06-15",edate: "2017-07-01", index: 2200.0, price_id: 1},
    {udate: "2017-07-01",edate: "2017-07-15", index: 2900.0, price_id: 1},
    {udate: "2017-07-15",edate: "2017-09-01", index: 3700.0, price_id: 1},
    {udate: "2017-09-01",edate: "2017-09-15", index: 1800.0, price_id: 1},
    {udate: "2017-09-15",edate: "2017-10-01", index: 1500.0, price_id: 1},
    {udate: "2017-10-01",edate: "2017-11-30", index: 0.0, price_id: 1},
    ])
Taryph.create([
    {udate: "2017-01-10",edate: "2017-04-26", index: 500.0, price_id: 2},
    {udate: "2017-04-26",edate: "2017-05-10", index: 900.0, price_id: 2},
    {udate: "2017-05-10",edate: "2017-06-01", index: 300.0, price_id: 2},
    {udate: "2017-06-01",edate: "2017-06-15", index: 1500.0, price_id: 2},
    {udate: "2017-06-15",edate: "2017-07-01", index: 2200.0, price_id: 2},
    {udate: "2017-07-01",edate: "2017-07-15", index: 2900.0, price_id: 2},
    {udate: "2017-07-15",edate: "2017-09-01", index: 3700.0, price_id: 2},
    {udate: "2017-09-01",edate: "2017-09-15", index: 1800.0, price_id: 2},
    {udate: "2017-09-15",edate: "2017-10-01", index: 1500.0, price_id: 2},
    {udate: "2017-10-01",edate: "2017-11-30", index: 0.0, price_id: 2},
    ])
Service.create([
    {name: "Встреча на Ж/Д вокзале", price: "1000", enable: true},
    {name: "Встреча в Аэропорту", price: "1000", enable: true},
    {name: "Экскурся в Олимпийский Парк", price: "1000", enable: true},
    {name: "Экскурсия на Красную Поляну", price: "1000", enable: true},
    {name: "Экскурсия на гору Ахун", price: "1000", enable: true},
    {name: "Посещение Океанариума", price: "1000", enable: true},
    {name: "Экскурсия в Парк \"Ривьера\"", price: "1000", enable: true},
    {name: "Ночной Сочи", price: "1000", enable: true},
    {name: "Стирка", price: "1000", enable: true},
    ])